Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་དེ་བཞིན་གཤེགས་པའི་གསང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། །
en: The Noble Mahāyāna Sūtra The Teaching of the Mysteries and Secrets of the Realized Ones

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པའི་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན། བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་དགེ་སློང་བཞི་ཁྲི་ཉིས་སྟོང་གི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མངོན་པར་ཤེས་པ་མངོན་པར་ཤེས་པ་ཕལ་ཆེར་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་ནས་འདུས་པའི་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was staying at Vulture Peak in Rājagṛha together with a great monastic assembly of forty-two thousand monks, as well as eighty-four thousand bodhisattvas of great courage, who were well known on account of their fame, a great many of whom had come from other buddha domains.

source: ཐམས་ཅད་ཀྱང་བཟོད་པ་ཐོབ་པ།
en: All of them had attained the state of acceptance.

source: ཕྱིར་མི་ལྡོག་པ།
en: They could not be turned back.

source: སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ།
en: They were limited to only one more life.

source: གཟུངས་ཐོབ་པ།
en: They had acquired a powerful memory and the formulas that support it.

source: ཏིང་ངེ་འཛིན་ཐོབ་པ།
en: They had acquired states of meditative concentration.

source: སྤོབས་པ་ཐོགས་པ་མེད་པ།
en: Their inspired eloquence was without impediment.

source: ཕྱོགས་བཅུ་མཐའ་ཡས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་བ་ལ་མཁས་པ།
en: They were adept at traveling to limitless buddha domains throughout the ten directions.

source: མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཀྱིས་རྣམ་པར་རྩེན་པ།
en: They had made child’s play of the forms of knowledge including the supernormal faculties.

source: ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱི་ཟིལ་གྱིས་མི་ནོན་པ།
en: They were undefeated in argument by any and all proponents of rival doctrines.

source: བདུད་དང་ཕྱིར་རྒོལ་བ་བཅོམ་པ།
en: They had vanquished their adversaries and Māra in all his forms.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་བསམ་པ་དང་སྤྱོད་པའི་བསྒྲུབ་པ་ཤེས་པ།
en: They knew the outcome of the conduct, motivations, and intentions of all beings.

source: དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་ཤེས་པ་ལ་མཁས་པ།
en: They were skilled in knowing their faculties to be of a greater or lesser caliber.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཀྱི་ཚུལ་ལ་འཇུག་པར་རབ་ཏུ་ཞུགས་པ།
en: They had gained access to the guiding principles of all the perfections.

source: ཐབས་ལ་མཁས་པའི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པ།
en: They had reached perfection of the most perfect mastery of skill in means.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བསྟོད་ཅིང་བསྔགས་ཏེ། བཀུར་ལ་རབ་ཏུ་བསྔགས་པ།
en: They were praised, lauded, and extolled by all the buddhas.

source: བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དཔག་ཏུ་མེད་པར་བྱང་ཆུབ་ཀྱི་ལམ་མཐའ་ཡས་པ་མཐར་གཏུགས་པ།
en: They had come to the end of the endless path to awakening, which spans countless trillions of eons.

source: སེམས་ས་དང་། ཆུ་དང་། མེ་དང་། རླུང་དང་མཚུངས་པ།
en: Their minds were like earth, water, wind, and fire.

source: ནམ་མཁའ་ལྟར་མཐའ་ཡས་པའི་བྱམས་པ་བསྒོམ་པའི་རྣལ་འབྱོར་ལ་བརྩོན་པ། ཆགས་པའི་གནས་སྒྲིབ་པ་དང་། ཆོད་པ་དང་།
en: They were fully engaged in a practice of the meditation on love that was limitless like space.

source: ཀུན་ནས་ལྡང་བ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ།
en: They had risen above being disturbed, carried away, or overwhelmed by any object of attachment.

source: མཐུ་བོ་ཆེའི་ལུས་ཐོབ་པ།
en: They had obtained the body of a Nārāyaṇa.

source: རྡོ་རྗེ་ལྟར་སྲ་ཞིང་མི་ཚུགས་པའི་ལུས་དང་ལྡན་པ།
en: Their bodies were rock-solid and unbreakable as vajra.

source: སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་པ།
en: They roared the great lion’s roar.

source: འཁོར་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་པ་ལ་འཇིགས་པ་མེད་པར་མཁས་པ།
en: They had mastered the self-assurance needed to stand out in every assembly.

source: ཟླ་བ་དང་ཉི་མ་མོག་མོག་པོར་བྱེད་པ།
en: They outshone the sun and moon.

source: ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་དུས་གསུམ་མཉམ་པ་ཉིད་ཐོབ་པ།
en: They had attained the understanding that in reality all things are the same across the three times.

source: ཆོས་ཟབ་མོ་རྣམ་པར་ངེས་པ། ཡེ་ཤེས་ཀྱིས་སྟོན་པ་ལ་མཁས་པ།
en: They were adept at giving instructions with knowledge of the profound exegesis of the Dharma.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་ཞུགས་པས་རྟག་པ་དང་ཆད་པར་ལྟ་བའི་མཐའ་གཉིས་ཡོངས་སུ་སྤངས་པ། བསམ་གཏན་དང་།
en: By comprehending dependent arising they had abandoned the two extremes—the views that things are eternal and that they come to a complete end.

source: རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་དང་། མཉམ་པར་གཞག་པ་དང་། ལྡང་བ་ཤེས་པ་ལ་མཁས་པ།
en: They were adept at bringing about the emergence and stabilization of the meditations, the liberations, the concentrations, and the absorptions.

source: ཕྱོགས་བཅུར་སྒྲ་གྲགས་པ།
en: Their voices resounded throughout the ten directions.

source: དམ་པའི་ཆོས་དཀོན་མཆོག་གི་མཛོད་ཡང་དག་པར་འཛིན་པ།
en: They were in full possession of the treasury of jewels of the true Dharma.

source: དཀོན་མཆོག་གསུམ་གྱི་རིགས་རྒྱུན་མི་འཆད་པར་བྱེད་པ།
en: They made sure the lineage of the Three Jewels remained unbroken.

source: བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་དཔག་ཏུ་མེད་པ་བསགས་པ་ཤ་སྟག་ལ་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བའི་བླ་མ་ཞེས་བྱ་བ་དང་། ཟླ་བའི་ཏོག་དང་། རི་བོང་ཅན་གྱི་ཏོག་དང་། འོད་ཀྱི་ཏོག་དང་། འོད་དཔལ་དང་། དཔལ་བརྩེགས་དང་། དཔལ་སྦས་དང་། མཐུ་བོ་ཆེ་དང་། ཀླུ་དགའ་དང་། ཀླུའི་བླ་མ་དང་། ཀླུས་བྱིན་དང་། གཟུགས་འཛིན་དང་། མྱ་ངམ་གྱི་ལྷ་དང་། ཡོན་ཏན་སྒྲོན་མའི་རྒྱལ་པོ་དང་། ལག་ན་སྒྲོན་མ་དང་། རྟག་ཏུ་ལག་བཏེག་དང་། རྟག་ཏུ་ལག་བརྐྱང་དང་། ལག་ན་ཕྱག་རྒྱ་རིན་པོ་ཆེ་དང་།
en: They were fully equipped with a truly endless supply of merit and knowledge.

source: ལག་ན་རིན་པོ་ཆེ་དང་། ཀུན་དུ་སྣང་དང་། སྐར་མའི་རྒྱལ་པོ་དང་། ལག་ན་རྡོ་རྗེ་དང་། རྡོ་རྗེའི་བློ་གྲོས་དང་། རྡོ་རྗེའི་བློ་གྲོས་ཆེན་པོ་དང་། རྡོ་རྗེས་རྣམ་པར་གནོན་དང་། མི་གཡོ་བའི་གོམ་པར་འགྲོ་བ་དང་། འཇིག་རྟེན་གསུམ་རྣམ་པར་གནོན་དང་། མཐའ་ཡས་བློ་གྲོས་དང་། བློ་གྲོས་མཐའ་ཡས་དང་། བློ་གྲོས་རྒྱ་མཚོ་དང་། བརྟན་པའི་བློ་གྲོས་དང་། ནོར་གྱི་བློ་གྲོས་དང་། བླ་མའི་བློ་གྲོས་དང་། ཁྱད་པར་བློ་གྲོས་དང་། འཕེལ་བའི་བློ་གྲོས་དང་། རྟག་ཏུ་མོས་དང་། རྟག་ཏུ་དགོད་ཅིང་རབ་ཏུ་དགའ་བའི་དབང་པོ་དང་། །ངན་སོང་སྤོང་དང་། སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་དང་། ཤིན་ཏུ་རྣམ་པར་སྦྱངས་པ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་འཆང་བ་དང་། བརྩོན་འགྲུས་འབར་དང་། ཤེས་རབ་བརྩེགས་དང་། རྟག་པར་ལྟ་དང་། སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། མཐུ་ཆེན་ཐོབ་དང་། ལྷུན་པོ་བརྩེགས་དང་། ནམ་མཁའི་མཛོད་དང་། མི་འཛུམས་པ་དང་། བརྗོད་མེད་དང་། རིན་ཆེན་དམ་པ་དང་། རིན་ཆེན་སེམས་པ་དང་། ལེགས་པར་རྣམ་པར་སེམས་པ་དང་། དོན་ལེགས་པར་རྣམ་པར་བསམས་པ་དང་། ཤིན་དུ་ངེས་པའི་བློ་གྲོས་དང་། གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོ་དང་། ས་འཛིན་དང་། བཀོད་པའི་རྒྱལ་པོ་དང་། ཞིང་ཡང་དག་པར་བརྒྱན་པ་དང་། རིན་ཆེན་འབྱུང་གནས་དང་། ཕུག་སྦས་དང་། དབང་པོའི་ལྷ་དང་། ཆུ་ལྷ་དང་། ཚངས་པ་དྲ་བ་ཅན་དང་། བྱང་ཆུབ་སེམས་དཔའི་འདྲ་བ་ཅན་གྱི་འོད་ཅེས་བྱ་བ་དང་། ལྷའི་ཅོད་པན་དང་། ལག་བཟངས་དང་། མིག་བཟངས་དང་། སྤོས་ཀྱི་གླང་པོ་དང་། བལ་གླང་སྤོས་ཀྱི་གླང་པོ་ཆེ་དང་། སེང་གེའི་ཏོག་དང་། དོན་གྲུབ་བློ་གྲོས་དང་། ཁ་ལོ་སྒྱུར་དང་། ཞི་བའི་བློ་གྲོས་དང་། བྱམས་པ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། དེ་དག་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་།
en: Among those eighty-four thousand bodhisattvas were the bodhisattvas named Candrottara, Candraketu, Śaśiketu, Prabhāketu, Prabhāśrī, Śrīkūṭa, Śrīgupta, He Whose Power Is Great, Nāganandin, Nāgottara, Nāgadatta, He Who Possesses a Beautiful Form, Marudeva, Guṇadīparāja, Dīpahasta, Nityotpalakṛtahasta, Nityotkṣiptahasta, Ratnamudrāhasta, Ratnapāṇi, Total Illumination, Nakṣatrarāja, Vajrapāṇi, Vajramati, He Whose Great Intelligence Is Strong as a Vajra, Vajravikrāmin, Sthirapadavikrāmin, Trailokyavikrāmin, Anantavikrāmin, Anantamati, Sāgaramati, Dṛḍhamati, He Whose Intelligence Is His Treasure, Uttaramati, Viśeṣamati, Vardhamānamati, Ever Faithful, Ever-Laughing and Joyful Lord, Apāyajaha, Sarvanīvaraṇaviṣkambhin, He Who Possesses a Refined and Immaculate Splendor, Uttaptavīrya, Prajñākūṭa, Always Watching, Avalokiteśvara, Mahāsthāmaprāpta, Merukūṭa, Gaganagañja, Unwavering Gaze, Inexpressible One, Sublime Jewel, Jewel Mind, He Who Has Thought Well, Suvicintitārtha, He Whose Intelligence Rests on What Is Certain, Dharaṇīśvararāja, Dharaṇīdhara, Vyūharāja, Kṣetrālaṃkṛta, Ratnākara, Guhyagupta, Indradeva, Varuṇa, Brahmajālin, the bodhisattva Jālinīprabha, Devamukuṭa, Subāhu, Sunetra, Gandhahastin, Gajagandhahastin, Siṃhaketu, Siddhārthamati, Sārathi, Śāntamati, Maitreya, and Prince Mañjuśrī.

source: གང་དག་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། དེ་མ་ཡིན་པའི་ལྷའི་དབང་པོ་འམ། ཀླུའི་དབང་པོ་འམ། གནོད་སྦྱིན་གྱི་དབང་པོ་འམ། དྲི་ཟའི་དབང་པོ་འམ། ལྷ་མ་ཡིན་གྱི་དབང་པོའམ། ནམ་མཁའ་ལྡིང་གི་དབང་པོ་འམ། མི་འམ་ཅིའི་དབང་པོ་འམ། ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོ་དབང་ཆེ་བ། དབང་ཆེ་བར་གྲགས་པ་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་པ་ལ་འདི་ལྟ་སྟེ། ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་ཞེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་དང་། ཆུ་ལྷ་དང་། གཟི་ཅན་དང་། འཇོག་པོ་དང་། གསེར་མདོག་དང་། ཁ་དོག་མཐའ་ཡས་དང་། ཀླུའི་རྒྱལ་པོ་མཚམས་བཟངས་དང་།
en: Also present in the assembly were Śakra, Brahmā, and the Lokapālas of this cosmos of a billion worlds, as well as various other supreme deities, nāga lords, yakṣa lords, gandharva lords, asura lords, garuḍa lords, kinnara lords, and mahoraga lords, all of whom were renowned for their sovereign authority.

source: དེ་དག་དང་གཞན་ཡང་ཀླུའི་རྒྱལ་པོ་འཁོར་དང་བཅས་པ་བརྒྱ་སྟོང་ཕྲག་མང་པོ་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། མཆོད་པ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། ཆོས་མཉན་པའི་ཕྱིར་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏོ། །ལྷ་མ་ཡིན་གྱི་དབང་པོ་སྒྲ་གཅན་དང་། ཐགས་ཟངས་རིས་དང་། ལག་བཟངས་དང་། ས་ལ་དང་། ཏ་ལ་དང་། བདེ་མཆོག་དང་། རབ་སིམ་དང་། ཆེ་རབ་དང་། ལྷ་མ་ཡིན་གྱི་དབང་པོ་གནོད་སྦྱིན་གཞན་དང་། དེ་དག་དང་།
en: Among them, the nāga king Anavatapta, as well as Sāgara, Varuṇa, Manasvin, Takṣaka, Hemavarṇa, Endless Colors, Susīma, and many hundreds of thousands of other nāga kings with their retinues had joined the assembly in order to see the Blessed One, to honor him, to worship him, to serve him, and to hear the Dharma.

source: གཞན་ཡང་ལྷ་མ་ཡིན་གྱི་དབང་པོ་འཁོར་དང་བཅས་པ་བརྒྱ་སྟོང་མང་པོ་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། མཆོད་པ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། ཆོས་མཉན་པའི་ཕྱིར་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏོ། །
en: The asura lords, such as Rāhu, Vemacitra, Subāhu, Sāla, Tāla, Śambara, Prahlāda, and The Huge One, as well as other yakṣas and asura lords and their retinues, had also joined the assembly to see the Blessed One, to honor him, to worship him, to serve him, and to hear the Dharma.

source: རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ཡང་བཙུན་མོའི་འཁོར་དང་བཅས། རང་གི་གཉེན་དང་། འཁོར་དང་བཅས་ཏེ་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། མཆོད་པ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། ཆོས་མཉན་པའི་ཕྱིར་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏོ། །དེ་མ་ཡིན་པའི་གཞན་ཡང་འཁོར་བཞི་པོ་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་།
en: King Ajātaśatru, the women from the king’s inner chambers, and his relatives had also joined the assembly to see the Blessed One, to honor him, to worship him, to serve him, and to hear the Dharma.

source: དགེ་བསྙེན་མ་རྣམས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། མཆོད་པ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། ཆོས་མཉན་པའི་ཕྱིར་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏོ། །ས་བླ་ན་སྤྱོད་པའི་ལྷའི་བུ་རྣམས་དང་།
en: Moreover, the fourfold assembly of monks, nuns, laymen, and laywomen had also joined the assembly to see the Blessed One, to honor him, to worship him, to serve him, and to hear the Dharma.

source: འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པ་དང་། གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་ཀྱང་། བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་།
en: The gods who live in the sky, along with the gods from the realms of desire and form, as well as those gods from the pure abodes had also joined the assembly to see the Blessed One, to honor him, to worship him, to serve him, and to hear the Dharma.

source: མཆོད་པ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། ཆོས་མཉན་པའི་ཕྱིར་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏོ། །དེ་ནས་བཅོམ་ལྡན་འདས་འཁོར་བརྒྱ་སྟོང་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་ཏེ་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཚོགས་རྣམ་པར་དག་པའི་སྒོ་བསྡུ་བ་ཡོངས་སུ་བཀང་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: On that occasion, surrounded by and at the head of an assembly of countless hundreds of thousands, the Blessed One taught the Dharma on the collection of gateways into the purity of the supplies of the bodhisattvas of great courage so that they could completely fill their stores.

source: འདི་ལྟ་སྟེ།
en: This is what he said:

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྦྱིན་པའི་ཚོགས་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་འགྱུར་རོ། །
en: “The bodhisattvas’ supply of generosity serves the purpose of bringing beings to maturity.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་ཚོགས་ནི་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: The bodhisattvas’ supply of moral conduct serves the purpose of fulfilling their vows.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བཟོད་པའི་ཚོགས་ནི་མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: The bodhisattvas’ supply of patience serves the purpose of acquiring the major and minor marks of a great person.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བརྩོན་འགྲུས་ཀྱི་ཚོགས་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: The bodhisattvas’ supply of heroic effort serves the purpose of acquiring all the qualities of a buddha.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་གཏན་གྱི་ཚོགས་ནི་ཅང་ཤེས་ཀྱི་སེམས་སུ་འགྱུར་རོ། །
en: The bodhisattvas’ supply of meditation serves the purpose of acquiring the mind of one who is well bred.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་ཚོགས་ནི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤོང་བར་འགྱུར་རོ། །
en: The bodhisattvas’ supply of wisdom serves the purpose of eliminating all the afflictions.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆོས་བསྟན་པའི་ཚོགས་ནི་སྤོབས་པ་ཐོགས་པ་མེད་པར་འགྱུར་རོ། །
en: “The bodhisattvas’ supply of teaching the Dharma serves the purpose of removing impediments to their inspired eloquence.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསོད་ནམས་ཀྱི་ཚོགས་ནི་སེམས་ཅན་ཐམས་ཅད་ཉེ་བར་འཚོ་བར་འགྱུར་རོ། །
en: The bodhisattvas’ supply of merit serves the purpose of sustaining all beings.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡེ་ཤེས་ཀྱི་ཚོགས་ནི་ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་སུ་འགྱུར་རོ། །
en: The bodhisattvas’ supply of knowledge serves the purpose of removing impediments to their knowledge.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཞི་གནས་ཀྱི་ཚོགས་ནི་སེམས་ལས་སུ་རུང་བར་འགྱུར་རོ། །
en: The bodhisattvas’ supply of calm abiding serves the purpose of making the mind ready for any endeavor.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལྷག་མཐོང་གི་ཚོགས་ནི་ཐེ་ཙོམ་དང་བྲལ་བར་འགྱུར་རོ། །
en: The bodhisattvas’ supply of deep insight serves the purpose of becoming free from doubt.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱམས་པའི་ཚོགས་ནི་ཞེ་འགྲས་པ་མེད་པའི་སེམས་སུ་འགྱུར་རོ། །
en: “The bodhisattvas’ supply of love serves the purpose of ridding the mind of malice.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྙིང་རྗེའི་ཚོགས་ནི་ཡོངས་སུ་མི་སྐྱོ་བའི་སེམས་སུ་འགྱུར་རོ། །
en: The bodhisattvas’ supply of compassion serves the purpose of ridding the mind of despondency.

source: དགའ་བའི་ཚོགས་ནི་ཆོས་ཀྱི་ཀུན་དགའ་ལ་དགའ་ཞིང་མོས་པར་འགྱུར་རོ། །
en: Their supply of joy serves the purpose of finding happiness and satisfaction in the supreme joy of the Dharma.

source: བཏང་སྙོམས་ཀྱི་ཚོགས་ནི་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་སྤོང་བར་འགྱུར་རོ། །
en: Their supply of equanimity serves the purpose of ridding themselves of attachment and aversion.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆོས་མཉན་པའི་ཚོགས་ནི་སྒྲིབ་པ་སྤོང་བར་འགྱུར་རོ། །
en: The bodhisattvas’ supply of hearing the Dharma serves the purpose of becoming free from hindrances.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མངོན་པར་འབྱུང་བའི་ཚོགས་ནི་ཡོངས་སུ་འཛིན་པ་ཐམས་ཅད་འདོར་བར་འགྱུར་རོ། །
en: The bodhisattvas’ supply of leaving home for the ascetic life serves the purpose of casting aside all their belongings.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགོན་པ་ལ་གནས་པའི་ཚོགས་ནི་བྱས་པའི་ལས་ཆུད་མི་ཟ་བར་འགྱུར་རོ། །
en: The bodhisattvas’ supply of dwelling in the forest serves the purpose of not squandering the work they have already done.

source: དྲན་པའི་ཚོགས་ནི་གཟུངས་ཐོབ་པར་འགྱུར་རོ། །
en: “Their supply of mindfulness serves the purpose of attaining a powerful memory and the formulas that support it.

source: བློ་གྲོས་ཀྱི་ཚོགས་ནི་བློ་རབ་ཏུ་འབྱེད་པར་འགྱུར་རོ། །
en: Their supply of intelligence serves the purpose of developing a discerning mind.

source: རྟོགས་པའི་ཚོགས་ནི་དོན་རྟོགས་པའི་རྗེས་སུ་འགྲོ་བར་འགྱུར་རོ། །
en: Their supply of comprehension serves the purpose of enabling them to conform with their comprehension of the true meaning.

source: དྲན་པ་ཉེ་བར་གཞག་པའི་ཚོགས་ནི་ལུས་དང་། ཚོར་བ་དང་། སེམས་དང་། ཆོས་ལ་སོ་སོར་རྟོག་པར་འགྱུར་རོ། །
en: Their supply of the applications of mindfulness serves the purpose of carefully observing the body, feelings, mind, and mental objects.

source: ཡང་དག་པའི་སྤོང་བའི་ཚོགས་ནི་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྤོང་བ་དང་། དགེ་བའི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: Their supply of right effort serves the purpose of ridding themselves of all vicious qualities and filling up their reserves of all virtuous qualities.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པའི་ཚོགས་ནི་ལུས་དང་སེམས་ཡང་བར་འགྱུར་རོ། །
en: “Their supply of the foundations for superhuman power serves the purpose of making the body and mind agile.

source: དབང་པོ་ལྔའི་ཚོགས་ནི་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་ཤེས་པར་འགྱུར་རོ། །
en: Their supply of the five spiritual faculties serves the purpose of knowing beings’ faculties to be of a greater or lesser caliber.

source: སྟོབས་ལྔའི་ཚོགས་ནི་ཉོན་མོངས་པ་ཅན་ཐམས་ཅད་ཀྱིས་མི་རྫི་བར་འགྱུར་རོ། །
en: Their supply of the five powers serves the purpose of not being crushed under the weight of all the afflictions.

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཚོགས་ནི་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་ཁོང་དུ་ཆུད་པར་འགྱུར་རོ། །
en: Their supply of the constitutive factors of awakening serves the purpose of becoming awake to the true nature of all things.

source: ལམ་གྱི་ཚོགས་ནི་ལམ་ངན་པ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདའ་བར་འགྱུར་རོ། །
en: “Their supply of the path serves the purpose of going beyond all bad paths.

source: བདེན་པའི་ཚོགས་ནི་མི་འཁྲུགས་པའི་ཆོས་ཉིད་དུ་འགྱུར་རོ། །
en: Their supply of the truths serves the purpose of acquiring an unshakeable knowledge of the true nature of things.

source: སོ་སོ་ཡང་དག་པར་རིག་པའི་ཚོགས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེ་ཙོམ་གཅོད་པར་འགྱུར་རོ། །
en: Their supply of the special modes of knowledge serves the purpose of dispelling the doubts of all beings.

source: རྟོན་པའི་ཚོགས་ནི་གཞན་ལ་རག་མ་ལས་པའི་ཡེ་ཤེས་སུ་འགྱུར་རོ། །
en: Their supply of reliance serves the purpose of acquiring a knowledge that does not rely upon anyone else.

source: དགེ་བའི་བཤེས་གཉེན་གྱི་ཚོགས་ནི་ཡོན་ཏན་ཐམས་ཅད་སྐྱེ་བའི་སྒོར་འགྱུར་རོ། །
en: Their supply of companions in what is good serves the purpose of becoming a source for the development of all good qualities.

source: བསམ་པའི་ཚོགས་ནི་འཇིག་རྟེན་ཐམས་ཅད་ལ་མི་སླུ་བར་འགྱུར་རོ། །
en: “Their supply of motivation serves the purpose of keeping their word to all people.

source: ལྷག་པའི་བསམ་པའི་ཚོགས་ནི་ཁྱད་པར་དུ་འགྲོ་བར་འགྱུར་རོ། །
en: Their supply of ambition serves the purpose of becoming a superior being.

source: སྦྱོར་བའི་ཚོགས་ནི་རྩོམ་པ་ཐམས་ཅད་ཉམས་འོག་ཏུ་ཆུད་པར་འགྱུར་རོ། །
en: Their supply of practice serves the purpose of bringing to completion everything they have begun.

source: ནང་དུ་ཡང་དག་འཇོག་གི་ཚོགས་ནི་ཇི་སྐད་ཐོས་པའི་ཆོས་ཆུད་མི་གཟོན་པར་འགྱུར་རོ། །
en: Their supply of seclusion serves the purpose of not wasting the teachings just as they have heard them.

source: བསྡུ་བའི་དངོས་པོའི་ཚོགས་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་འགྱུར་རོ། །
en: Their supply of the means of drawing others to oneself serves the purpose of bringing beings to maturity.

source: དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའི་ཚོགས་ནི་དཀོན་མཆོག་གསུམ་གྱི་རིགས་རྒྱུན་མི་གཅོད་པར་འགྱུར་རོ། །
en: Their supply of possession of the true Dharma serves the purpose of making sure the lineage of the Three Jewels remains unbroken.

source: བསྔོ་བ་ལ་མཁས་པའི་ཚོགས་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་འགྱུར་རོ། །
en: Their supply of mastery of the dedication of merit serves the purpose of purifying a buddha domain.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐབས་ལ་མཁས་པའི་ཚོགས་ནི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: The supply of the bodhisattvas’ mastery of skill in means serves the purpose of perfecting the knowledge of an omniscient one.”

source: དེ་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཚོགས་རྣམ་པར་དག་པའི་སྒོ་བསྡུ་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་རྒྱས་པར་བཤད་དོ། །ཚོགས་རྣམ་པར་དག་པའི་སྒོ་བསྡུ་བ་བསྟན་པ་འདི་བཤད་པའི་ཚེ།
en: Thus the Blessed One gave to the bodhisattvas of great courage a detailed formulation of the Dharma known as the collection of gateways into the purity of the supplies.

source: བཅོམ་ལྡན་འདས་ཀྱི་གཡས་ཕྱོགས་ན་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་རྡོ་རྗེ་ཐོགས་ནས་འདུག་པར་གྱུར་ཏོ།
en: As the Blessed One was giving this teaching, Vajrapāṇi, Lord of the Guhyakas, was seated on his right-hand side while holding up his vajra.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །ཇི་ཙམ་དུ་དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཚོགས་རྣམ་པར་དག་པའི་སྒོ་བསྡུ་བ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལེགས་པར་གསུངས་པ་ནི་བཅོམ་ལྡན་འདས་ངོ་མཚར་ལགས་སོ། །
en: When the Blessed One had finished, Vajrapāṇi, Lord of the Guhyakas, said to him, “It is marvelous, Blessed One, how well the Realized One has expressed this formulation of the Dharma on the collection of gateways into the purity of the supplies of the bodhisattvas of great courage.

source: ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཇི་སྐད་བཤད་པའི་དོན་བདག་གིས་འཚལ་བ་ལྟར་ན། བདག་འདི་སྙམ་བགྱིད་དེ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཚོགས་དེ་དག་ཐམས་ཅད་ནི་བསོད་ནམས་ཀྱི་ཚོགས་དང་། ཡེ་ཤེས་ཀྱི་ཚོགས་ཀྱི་ནང་དུ་འདུས་ཤིང་རྗེས་སུ་ཞུགས་པར་འཚལ་བར་བགྱིའོ། །
en: If I were to state what I understood to be the import of the Blessed One’s words, then, Blessed One, I would say that all the supplies of the bodhisattvas of great courage are subsumed within the supplies of merit and knowledge, and can be accessed in this way.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་བསོད་ནམས་ཀྱི་ཚོགས་ནི་རྣམ་པར་བསྒྲུབ་པ་ཐམས་ཅད་རྣམ་པར་སྒྲུབ་པོ། ཡེ་ཤེས་ཀྱི་ཚོགས་ནི་སེམས་ཅན་ཐམས་ཅད་ལེགས་པར་བཤད་པས་ཚིམ་པར་བགྱིད་དོ། །
en: “The reason for this, Blessed One, is that the supply of merit of bodhisattvas of great courage provides a foundation for all their accomplishments, and their supply of knowledge makes all beings satisfied with what has been well said.

source: བཅོམ་ལྡན་འདས་དེ་ལྟ་བས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བསོད་ནམས་ཀྱི་ཚོགས་དང་། ཡེ་ཤེས་ཀྱི་ཚོགས་ལ་བརྩོན་པར་བགྱིའོ། །
en: Therefore, Blessed One, bodhisattvas of great courage should make efforts to acquire the supplies of merit and knowledge.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་བསོད་ནམས་ཀྱི་ཚོགས་ཀྱིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐབས་ལ་མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བགྱིད་དོ། །
en: The reason for this, Blessed One, is that the supply of merit brings to completion the perfection that is the bodhisattvas’ mastery of skill in means.

source: ཡེ་ཤེས་ཀྱི་ཚོགས་ཀྱིས་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བགྱིད་དེ།
en: The supply of knowledge brings to completion their perfection of wisdom.

source: བྱང་ཆུབ་སེམས་དཔའི་ལམ་འདི་གཉིས་ནི་ལམ་ཐམས་ཅད་སྡུད་པར་འགྱུར་བ་ལགས་སོ། །
en: These two paths of the bodhisattvas’ conduct serve the purpose of bringing together all paths.

source: བྱང་ཆུབ་སེམས་དཔའ་ལམ་ལ་གནས་པ་ནི་བདུད་སྡིག་ཅན་གྱིས་ཐུལ་བར་དཀའོ། །བདུད་ཀྱི་ལམ་ལས་ཡང་དག་པར་འདས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་ཏེ།
en: “A bodhisattva who is on the path is difficult for the evil Māra to defeat, and the bodhisattva who has stepped beyond the path of Māra cannot be turned back from unsurpassable and perfect awakening.

source: ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དེ་བཞིན་གཤེགས་པའི་གསང་བ་ཐམས་ཅད་སྟོན་ཏེ་མི་འཆབ་བོ། །
en: To such an irreversible bodhisattva, the blessed buddhas teach the secrets of the realized ones without concealing anything.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then the bodhisattva Śāntamati said to Vajrapāṇi, Lord of the Guhyakas, “Lord of the Guhyakas, you have been a close attendant and constant companion of the Realized One.
